toasterllc/MDCCode/Code/STM32/STApp/Source/main.cpp
    // Clear LOCKLPM5 in the PM5CTL0 register
    // This is necessary to be able to control the GPIOs
    _MSP.write(PM5CTL0, 0x0010);
    
    // Clear PAOUT so everything is driven to 0 by default
    _MSP.write(PAOUT, 0x0000);
}

// MARK: - SD Card

static void _SDSetPowerEnabled(bool en) {
    constexpr uint16_t BITB         = 1<<0xB;
    constexpr uint16_t VDD_SD_EN    = BITB;
    constexpr uint16_t PADIRAddr    = 0x0204;
    constexpr uint16_t PAOUTAddr    = 0x0202;
    
    const uint16_t PADIR = _MSP.read(PADIRAddr);
    const uint16_t PAOUT = _MSP.read(PAOUTAddr);
    _MSP.write(PADIRAddr, PADIR | VDD_SD_EN);
    
    if (en) {
        _MSP.write(PAOUTAddr, PAOUT | VDD_SD_EN);
    } else {
        _MSP.write(PAOUTAddr, PAOUT & ~VDD_SD_EN);
    }
    
    // The TPS22919 takes 1ms for VDD to reach 2.8V (empirically measured)
    _Scheduler::SleepMs<2>();
}

[[noreturn]]
static void _SDError(uint16_t line) {
    _System::Abort();
}

static void _ImgSetPowerEnabled(bool en) {
    constexpr uint16_t BIT0             = 1<<0;
    constexpr uint16_t BIT2             = 1<<2;
    constexpr uint16_t VDD_1V9_IMG_EN   = BIT0;
    constexpr uint16_t VDD_2V8_IMG_EN   = BIT2;
    constexpr uint16_t PADIRAddr        = 0x0204;
    constexpr uint16_t PAOUTAddr        = 0x0202;
    
    const uint16_t PADIR = _MSP.read(PADIRAddr);
    const uint16_t PAOUT = _MSP.read(PAOUTAddr);
    _MSP.write(PADIRAddr, PADIR | (VDD_2V8_IMG_EN | VDD_1V9_IMG_EN));
    
    if (en) {
        _MSP.write(PAOUTAddr, PAOUT | (VDD_2V8_IMG_EN));
        _Scheduler::SleepMs<1>(); // 100us delay needed between power on of VAA (2V8) and VDD_IO (1V9)
        _MSP.write(PAOUTAddr, PAOUT | (VDD_2V8_IMG_EN|VDD_1V9_IMG_EN));
    
    } else {
        // No delay between 2V8/1V9 needed for power down (per AR0330CS datasheet)
        _MSP.write(PAOUTAddr, PAOUT & ~(VDD_2V8_IMG_EN|VDD_1V9_IMG_EN));
    }
    
    #warning TODO: measure how long it takes for IMG rails to rise
    // The TPS22919 takes 1ms for VDD_2V8_IMG VDD to reach 2.8V (empirically measured)
    _Scheduler::SleepMs<2>();
}

[[noreturn]]
static void _ImgError(uint16_t line) {
    _System::Abort();
}

// MARK: - Tasks

// _TaskUSBDataOut: reads `len` bytes from the DataOut endpoint and writes them to _Bufs
struct _TaskUSBDataOut {
    static void Start(size_t l) {
        // Make sure this task isn't busy
        Assert(!_Scheduler::Running<_TaskUSBDataOut>());
        
        static size_t len = 0;
        len = l;
        _Scheduler::Start<_TaskUSBDataOut>([] {
            while (len) {
                _Scheduler::Wait([] { return !_Bufs.full(); });
                
                auto& buf = _Bufs.back();
                // Prepare to receive either `len` bytes or the
                // buffer capacity bytes, whichever is smaller.
                const size_t cap = _USB.CeilToMaxPacketSize(_USB.MaxPacketSizeOut(), std::min(len, sizeof(buf.data)));
                // Ensure that after rounding up to the nearest packet size, we don't
                // exceed the buffer capacity. (This should always be safe as long as
                // the buffer capacity is a multiple of the max packet size.)
                Assert(cap <= sizeof(buf.data));
                _USB.recv(Endpoints::DataOut, buf.data, cap);
                _Scheduler::Wait([] { return _USB.endpointReady(Endpoints::DataOut); });
                
                // Never claim that we read more than the requested data, even if ceiling
                // to the max packet size caused us to read more than requested.
                const size_t recvLen = std::min(len, _USB.recvLen(Endpoints::DataOut));
                len -= recvLen;
                buf.len = recvLen;
                _Bufs.push();
            }
        });
    }
    
    // Task options
    static constexpr Toastbox::TaskOptions Options{};
    
    // Task stack
    [[gnu::section(".stack._TaskUSBDataOut")]]
    static inline uint8_t Stack[256];
};

// _TaskUSBDataIn: writes buffers from _Bufs to the DataIn endpoint, and pops them from _Bufs
struct _TaskUSBDataIn {
    static void Start() {
        _Scheduler::Start<_TaskUSBDataIn>([] {
            for (;;) {
                _Scheduler::Wait([] { return !_Bufs.empty(); });
                
                // Send the data and wait until the transfer is complete
                auto& buf = _Bufs.front();
                _USB.send(Endpoints::DataIn, buf.data, buf.len);
                _Scheduler::Wait([] { return _USB.endpointReady(Endpoints::DataIn); });
                
                buf.len = 0;
                _Bufs.pop();
            }
        });
    }
    
    // Task options
    static constexpr Toastbox::TaskOptions Options{};
    
    // Task stack
    [[gnu::section(".stack._TaskUSBDataIn")]]
    static inline uint8_t Stack[256];
};

// _TaskReadout:
struct _TaskReadout {
    static void Start(std::optional<size_t> len) {
        static std::optional<size_t> remLen;
        remLen = len;
        
        _Scheduler::Start<_TaskReadout>([] {
            // Reset state
            _Bufs.reset();
            // Start the USB DataIn task
            _TaskUSBDataIn::Start();
            
            // Send the Readout message, which causes us to enter the readout mode until
            // we release the chip select
            _ICE_ST_SPI_CS_::Write(0);
            _QSPI_ICEApp.command(_QSPI_ICEAppCmd(_ICE::ReadoutMsg(), 0));
            
            // Read data over QSPI and write it to USB, indefinitely
            for (;;) {
                // Wait until: there's an available buffer, QSPI is ready, and ICE40 says data is available
                _Scheduler::Wait([] { return !_Bufs.full() && _QSPI_ICEApp.ready(); });
                
                const size_t len = std::min(remLen.value_or(SIZE_MAX), _ICE::ReadoutMsg::ReadoutLen);
                auto& buf = _Bufs.back();
                
                // If there's no more data to read, bail
                if (!len) {
                    // Before bailing, push the final buffer if it holds data
                    if (buf.len) _Bufs.push();
                    break;
                }
                
                // If we can't read any more data into the producer buffer,
                // push it so the data will be sent over USB
                if (sizeof(buf.data)-buf.len < len) {
                    _Bufs.push();
                    continue;
                }
                
                // Wait until ICE40 signals that data is ready to be read
                #warning TODO: we should institute yield after some number of retries to avoid crashing the system if we never get data
                while (!_ICE_ST_SPI_D_READY::Read());
                
                _QSPI_ICEApp.read(_QSPI_ICEAppCmdReadOnly(len), buf.data+buf.len);
                buf.len += len;
                
                if (remLen) *remLen -= len;
            }
        });
    }
    
    static void DidStop() {
        // De-assert the SPI chip select when the _TaskReadout is stopped.
        // This is necessary because the _TaskReadout asserts the SPI chip select,
        // but never deasserts it because _TaskReadout continues indefinitely.
        _ICE_ST_SPI_CS_::Write(1);
    }
    
    // Task options
    static constexpr Toastbox::TaskOptions Options{
        .DidStop = DidStop,
    };
    
