toasterllc/MDCCode/Code/STM32/STApp/Source/main.cpp
static void _MSPDebugHandleSBWIO(const MSPDebugCmd& cmd, _MSPDebugState& state, _BufQueue::Buf& buf) {
    const bool tdo = _MSP.debugSBWIO(cmd.tmsGet(), cmd.tclkGet(), cmd.tdiGet());
    if (cmd.tdoReadGet()) {
        // Enqueue a new bit
        state.bits <<= 1;
        state.bits |= tdo;
        state.bitsLen++;
        
        // Enqueue the byte if it's filled
        if (state.bitsLen == 8) {
            _MSPDebugPushReadBits(state, buf);
        }
    }
}

static void _MSPDebugHandleCmd(const MSPDebugCmd& cmd, _MSPDebugState& state, _BufQueue::Buf& buf) {
    switch (cmd.opGet()) {
    case MSPDebugCmd::Ops::TestSet:     _MSP.debugTestSet(cmd.pinValGet());     break;
    case MSPDebugCmd::Ops::RstSet:      _MSP.debugRstSet(cmd.pinValGet()); 	    break;
    case MSPDebugCmd::Ops::TestPulse:   _MSP.debugTestPulse(); 				    break;
    case MSPDebugCmd::Ops::SBWIO:       _MSPDebugHandleSBWIO(cmd, state, buf);	break;
    default:                            abort();
    }
}

static void _MSPDebug(const STM::Cmd& cmd) {
    auto& arg = cmd.arg.MSPDebug;
    
    // Bail if more data was requested than the size of our buffer
    if (arg.respLen > sizeof(_BufQueue::Buf::data)) {
        // Reject command
        _System::USBAcceptCommand(false);
        return;
    }
    
    // Accept command
    _System::USBAcceptCommand(true);
    
    // Reset state
    _Bufs.reset();
    auto& bufIn = _Bufs.back();
    _Bufs.push();
    auto& bufOut = _Bufs.back();
    
    _MSPDebugState state;
    
    // Handle debug commands
    {
        size_t cmdsLenRem = arg.cmdsLen;
        while (cmdsLenRem) {
            // Receive debug commands into buf
            _USB.recv(Endpoints::DataOut, bufIn.data, sizeof(bufIn.data));
            _Scheduler::Wait([] { return _USB.endpointReady(Endpoints::DataOut); });
            
            // Handle each MSPDebugCmd
            const MSPDebugCmd* cmds = (MSPDebugCmd*)bufIn.data;
            const size_t cmdsLen = _USB.recvLen(Endpoints::DataOut) / sizeof(MSPDebugCmd);
            for (size_t i=0; i<cmdsLen && state.ok; i++) {
                _MSPDebugHandleCmd(cmds[i], state, bufOut);
            }
            
            cmdsLenRem -= cmdsLen;
        }
    }
    
    // Reply with data generated from debug commands
    {
        // Push outstanding bits into the buffer
        // This is necessary for when the client reads a number of bits
        // that didn't fall on a byte boundary.
        if (state.bitsLen) _MSPDebugPushReadBits(state, bufOut);
        
        if (arg.respLen) {
            // Send the data and wait for it to be received
            _USB.send(Endpoints::DataIn, bufOut.data, arg.respLen);
            _Scheduler::Wait([] { return _USB.endpointReady(Endpoints::DataIn); });
        }
    }
    
    // Send status
    _System::USBSendStatus(state.ok);
}

static void _SDInit() {
    static bool init = false;
    if (init) return; // Short-circuit if we've already initialized
    
    _SDCard.enable();
    init = true;
}

static void _SDCardIdGet(const STM::Cmd& cmd) {
    // cardId: aligned to send via USB
    alignas(4) static SD::CardId cardId;
    
    // Accept command
    _System::USBAcceptCommand(true);
    
    // Initialize the SD card if we haven't done so
    _SDInit();
    
    // Send SD card id
    cardId = _SDCard.cardIdGet();
    _USB.send(Endpoints::DataIn, &cardId, sizeof(cardId));
    _Scheduler::Wait([] { return _USB.endpointReady(Endpoints::DataIn); });
}

static void _SDCardDataGet(const STM::Cmd& cmd) {
    // cardData: aligned to send via USB
    alignas(4) static SD::CardData cardData;
    
    // Accept command
    _System::USBAcceptCommand(true);
    
    // Initialize the SD card if we haven't done so
    _SDInit();
    
    // Send SD card data
    cardData = _SDCard.cardDataGet();
    _USB.send(Endpoints::DataIn, &cardData, sizeof(cardData));
    _Scheduler::Wait([] { return _USB.endpointReady(Endpoints::DataIn); });
}

static void _SDRead(const STM::Cmd& cmd) {
    static bool reading = false;
    const auto& arg = cmd.arg.SDRead;
    
    // Verify that the address is a multiple of the SD block length
    if (arg.addr % SD::BlockLen) {
        // Reject command
        _System::USBAcceptCommand(false);
        return;
    }
    
    // Accept command
    _System::USBAcceptCommand(true);
    
    // Initialize the SD card if we haven't done so
    _SDInit();
    
    // Stop reading from the SD card if a read is in progress
    if (reading) {
        _ICE_ST_SPI_CS_::Write(1);
        _SDCard.readStop();
        reading = false;
    }
    
    // Update state
    reading = true;
    _SDCard.readStart(arg.addr);
    
    // Start the Readout task
    _TaskReadout::Start(std::nullopt);
}

void _ImgInit() {
    static bool init = false;
    if (init) return;
    _ImgSensor::Enable();
    _ImgSensor::SetStreamEnabled(true);
    init = true;
}

void _ImgExposureSet(const STM::Cmd& cmd) {
    const auto& arg = cmd.arg.ImgExposureSet;
    
    // Accept command
    _System::USBAcceptCommand(true);
    
    _ImgInit();
    _ImgSensor::SetCoarseIntTime(arg.coarseIntTime);
    _ImgSensor::SetFineIntTime(arg.fineIntTime);
    _ImgSensor::SetAnalogGain(arg.analogGain);
    // Send status
    _System::USBSendStatus(true);
}

void _ImgCapture(const STM::Cmd& cmd) {
    const auto& arg = cmd.arg.ImgCapture;
    
    // Accept command
    _System::USBAcceptCommand(true);
    
    _ImgInit();
    
    const Img::Header header = {
        .magicVersion   = Img::Header::MagicVersion,
        .imageWidth     = Img::PixelWidth,
        .imageHeight    = Img::PixelHeight,
    };
    
    const _ICE::ImgCaptureStatusResp resp = _ICE::ImgCapture(header, arg.dstBlock, arg.skipCount);
    
    // stats: aligned to send via USB
    alignas(4) const ImgCaptureStats stats = {
        .len            = resp.wordCount()*sizeof(Img::Word),
        .highlightCount = resp.highlightCount(),
        .shadowCount    = resp.shadowCount(),
    };
    
    // Send ImgCaptureStats
    _USB.send(Endpoints::DataIn, &stats, sizeof(stats));
    _Scheduler::Wait([] { return _USB.endpointReady(Endpoints::DataIn); });
    
    // Arrange for the image to be read out
    _ICE::Transfer(_ICE::ImgReadoutMsg(arg.dstBlock));
    
    // Start the Readout task
    _TaskReadout::Start(stats.len);
}

static void _CmdHandle(const STM::Cmd& cmd) {
    switch (cmd.op) {
    // ICE40 Bootloader
    case Op::ICEWrite:          _ICEWrite(cmd);                     break;
    // MSP430 Bootloader
    case Op::MSPConnect:        _MSPConnect(cmd);                   break;
    case Op::MSPDisconnect:     _MSPDisconnect(cmd);                break;
    // MSP430 Debug
    case Op::MSPRead:           _MSPRead(cmd);                      break;
    case Op::MSPWrite:          _MSPWrite(cmd);                     break;
    case Op::MSPDebug:          _MSPDebug(cmd);                     break;
    // SD Card
    case Op::SDCardIdGet:       _SDCardIdGet(cmd);                  break;
    case Op::SDCardDataGet:     _SDCardDataGet(cmd);                break;
    case Op::SDRead:            _SDRead(cmd);                       break;
    // Img
    case Op::ImgCapture:        _ImgCapture(cmd);                   break;
    case Op::ImgExposureSet:    _ImgExposureSet(cmd);               break;
    // Bad command
    default:                    _System::USBAcceptCommand(false);   break;
    }
}

// MARK: - ISRs

extern "C" [[gnu::section(".isr")]] void ISR_NMI() {}
extern "C" [[gnu::section(".isr")]] void ISR_HardFault() { for (;;); }
extern "C" [[gnu::section(".isr")]] void ISR_MemManage() { for (;;); }
extern "C" [[gnu::section(".isr")]] void ISR_BusFault() { for (;;); }
extern "C" [[gnu::section(".isr")]] void ISR_UsageFault() { for (;;); }
extern "C" [[gnu::section(".isr")]] void ISR_SVC() {}
extern "C" [[gnu::section(".isr")]] void ISR_DebugMon() {}
extern "C" [[gnu::section(".isr")]] void ISR_PendSV() {}

extern "C" [[gnu::section(".isr")]] void ISR_SysTick() {
    _Scheduler::Tick();
    HAL_IncTick();
}

extern "C" [[gnu::section(".isr")]] void ISR_OTG_HS() {
    _USB.isr();
}

extern "C" [[gnu::section(".isr")]] void ISR_QUADSPI() {
    _QSPI.isrQSPI();
}

extern "C" [[gnu::section(".isr")]] void ISR_DMA2_Stream7() {
    _QSPI.isrDMA();
}

// MARK: - Abort

extern "C" [[noreturn]]
void abort() {
    _System::Abort();
}

// MARK: - Main

int main() {
//    volatile bool a = false;
//    while (!a);
    
    _System::Init();
    
    __HAL_RCC_GPIOI_CLK_ENABLE(); // ICE_CRST_, ICE_CDONE
    
//    _QSPI.init();
    
    _ICE_ST_SPI_CS_::Config(GPIO_MODE_OUTPUT_PP, GPIO_NOPULL, GPIO_SPEED_FREQ_VERY_HIGH, 0);
    _ICE_ST_SPI_CS_::Write(1);
    
//    _ICE::Init();
    _MSPInit();
    
    _Scheduler::Run();
    return 0;
}


#warning TODO: remove these debug symbols
#warning TODO: when we remove these, re-enable: Project > Optimization > Place [data/functions] in own section
constexpr auto& _Debug_Tasks              = _Scheduler::_Tasks;
constexpr auto& _Debug_DidWork            = _Scheduler::_DidWork;
constexpr auto& _Debug_CurrentTask        = _Scheduler::_CurrentTask;
constexpr auto& _Debug_CurrentTime        = _Scheduler::_ISR.CurrentTime;
constexpr auto& _Debug_Wake               = _Scheduler::_ISR.Wake;
constexpr auto& _Debug_WakeTime           = _Scheduler::_ISR.WakeTime;
